{
  "layers": [
    {
      "name": "model_weights",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/conv2d",
      "weights": 2,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/conv2d/conv2d",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/conv2d_1",
      "weights": 2,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/conv2d_1/conv2d_1",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/dense",
      "weights": 2,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/dense/dense",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/dense_1",
      "weights": 2,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/dense_1/dense_1",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/dropout",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/flatten",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/input_1",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/max_pooling2d",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/max_pooling2d_1",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "model_weights/top_level_model_weights",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights",
      "weights": 17,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/m",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/m/conv2d",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/m/conv2d_1",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/m/dense",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/m/dense_1",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/v",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/v/conv2d",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/v/conv2d_1",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/v/dense",
      "weights": 0,
      "trainable": "Unknown"
    },
    {
      "name": "optimizer_weights/Adam/v/dense_1",
      "weights": 0,
      "trainable": "Unknown"
    }
  ],
  "total_parameters": 25,
  "optimizer": null,
  "loss_function": null,
  "architecture": {
    "class_name": "Functional",
    "config": {
      "name": "model",
      "trainable": true,
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              128,
              109,
              1
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_1"
          },
          "name": "input_1",
          "inbound_nodes": []
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d",
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d",
          "inbound_nodes": [
            [
              [
                "conv2d",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_1",
          "inbound_nodes": [
            [
              [
                "max_pooling2d",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d_1",
          "inbound_nodes": [
            [
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten",
          "inbound_nodes": [
            [
              [
                "max_pooling2d_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense",
          "inbound_nodes": [
            [
              [
                "flatten",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "noise_shape": null,
            "seed": null
          },
          "name": "dropout",
          "inbound_nodes": [
            [
              [
                "dense",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_1",
          "inbound_nodes": [
            [
              [
                "dropout",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    }
  }
}